package com.yidao.project.heathproject.Beans;

import java.util.List;

public class RunBean {

    /**
     * code : 200
     * msg : SUCCESS
     * data : [{"title":"适宜心率","content":"您进行体育锻炼 \u201c适宜心率\u201d范围为130.0次/分钟\u2014\u2014170.0次/分钟之间，锻炼时至少要保持20 min以上。"},{"title":"体重控制","content":"正常 不错 比较标准！继续保持！"},{"title":"柔韧素质","content":"抬手侧压腿：\n动作要领：双手高举在自己的两侧太阳穴处，掌心朝外，双腿宽距张开，动作开始时朝一侧降低重心将腿压下去，交替进行，这个动作主要可以拉伸到我们的大腿后侧股二头肌的柔韧性。（固定展示）\n≤2分柔韧性较差者，可每天坚持锻炼，每天做3\u20144组，每组20个，左右腿交替进行，组间休息30秒。\n3分柔韧性中等水平，柔韧性者可每天坚持锻炼，每天做2\u20143组，每组20个，左右腿交替进行，组间休息30秒。\n≤4分柔韧性较好，柔韧性者可每天坚持锻炼，每天做1\u20142组，每组20个，左右腿交替进行，组间休息30秒。\n\n俯身拉伸：\n双腿同肩宽站立，动作开始时上半身俯身下去利用手掌去尽可能触碰我们的脚部，这个动作需要我们注意的是，为了达到更好的拉伸腰背部和我们的大腿肌肉的效果，我们在俯身下去的时候尽可能不要弯曲膝盖，保持一个最好的直腿状态（固定展示）\n≤2分柔韧性者较差者，可每天坚持锻炼，每天做4\u20145组，每组30秒，组间休息10秒\n3分柔韧性中等水平，柔韧性者可每天坚持锻炼，每天2\u20143组，每组30秒，组间休息10秒。\n≤4分柔韧性较好，柔韧性者可每天坚持锻炼，每天做1\u20142组，每组30秒，组间休息10秒。\n正踢腿：直立，两臂平举，左脚向前迈出一小步，右腿绷脚面伸直，起腿要轻，急速有力地向上踢腿，高度要高，落腿要稳，两腿交替练习。（固定展示）\n≤2分柔韧性者较差者，可每周做3\u20144次，每次做4\u20145组，每组10个，两腿交替进行，组间休息15秒。\n3分柔韧性中等水平，每周做2\u20143次，每次做4\u20145组，每组10个，两腿交替进行，组间休息15秒。\n≤4分握力较好，柔韧性每周做1\u20142次，每次做4\u20145组，每组10个，两腿交替进行，组间休息15秒。\n盘腿体前屈：两腿屈膝盘坐，两脚掌相对，两手握住两脚，上体前屈。复原姿势后连续再做一定次数左右腿互换。（固定展示）\n≤2分柔韧性者较差者，可每天锻炼，每天做4\u20145组，每组10个，两腿交换进行，组间休息10秒。\n3分柔韧性中等水平，可每周锻炼3\u20144次，每次做4\u20145组，每组10个，两腿交换进行，组间休息10秒。\n≤4分柔韧性较好，可每周做1\u20142次，每次做4\u20145组，每组10个，两腿交换进行，组间休息10秒。"},{"title":"有氧耐力","content":"游泳：测试时受试者自愿选择一种泳姿，在水质较好的室内游泳馆进行。\n游速较慢，小强度，心率不超过100次/分，每次3组，一组游10分钟，休息间隔5分钟，一周3\u20144次。\n自行车：受试者选择无故障的自行车尽量在平坦路面进行锻炼。\n骑行速度较慢，运动负荷为小强度，心率保持100左右，进行锻炼40min到1h，每周5次。\n跑步：选用舒适的服装和合适的跑鞋，在平坦的路上进行。\n走步1000米，心率100次/分以下，一周进行5次练习。\n健步走：躯干伸直，收腹、挺胸、抬头，随走步速度的加快而肘关节自然弯曲，以肩关节为轴自然前后摆臂，同时腿朝前迈，脚跟先着地，过渡到前脚掌，然后推离地面。\n中速走，每分钟90－120步，每次走40min以上，每周5次。\n跳绳：选择长短合适的绳子在开阔平坦的场地进行跳绳练习。\n慢速跳绳，运动强度8.0MET，每组4min，组间间歇3min，一次3组，每周5次。\n"},{"title":"平衡能力","content":"金鸡独立练习：站立位,向两侧伸直双臂,抬起左腿并屈曲,然后轮换右腿。等这个动作熟悉后,两眼微闭,再做这个动作,并且独立动作逐渐延长。\n坚持20秒钟,重复5次,然后轮换右腿，每天进行锻炼。\n单腿提膝:双脚并拢直立,开始时慢慢将重心转到右腿,呼气,抬起左膝,双手环抱左膝,并拉近身体,收紧腹肌,尽量将腰背伸展开,此时切勿含胸,在可能情况下,尽量将站立腿伸直,保持此姿势时间越长越好,呼气时手脚恢复原位,换做另一侧。当然重要的是坚持。\n坚持20秒钟,重复5次,然后轮换右腿，每天进行锻炼。\n轮滑：轮滑滑行采用上体前倾的半蹲式姿势，髋、膝、踝三关节呈屈的状态。合理的蹬伸顺序是，展髋的同时伸髋，再伸膝，最后伸踝。做好两腿之间的动作配合及臂与腿动作的配合\n每次锻炼持续时间应至少在60分钟以上，每周锻炼时间不少于4次。间隔时间不宜超过3天.\n太极拳训练\n太极拳每次锻炼持续时间应至少在60分钟以上，每周锻炼时间不少于4次。间隔时间不宜超过3天.\n"},{"title":"肌肉耐力","content":"仰卧起坐：测试时,受试者仰卧于水平放置的垫子上,双腿稍分开,屈膝呈90℃,双手手指交叉抱于脑后,由同伴压住双脚以固定下肢。利用腹肌收缩，迅速成坐姿，上体继续前屈，两手触脚面，低头;然后还原成坐姿。在做仰卧起坐时,身体前屈时应呼气，仰卧时应吸气。\n每组40个，控制在1分钟内，每组间隔15s，做3组，一周3-5次。\n仰卧举腿：身体仰卧，手臂要紧紧贴着身体两侧，下腹要缩紧，把双腿举到与地面垂直，要保持垂直状态5秒钟。\n每组40个，每组间隔15s，做3组，一周3-5次。\n平板支撑：俯卧，用脚趾支撑地面，90度弯曲肘关节，保持肘关节在肩膀的正下方。收紧腹部，抬高身体，直至头部、身体和双腿成一直线，保持脊椎中立位。维持正常呼吸，保持一分钟或尽可能长的时间。\n每组2min，每组间隔20s，做3组，一周3-5次。\n"},{"title":"肌肉力量","content":"握力器\n以4根手指为一点，拇指和虎口为另外一点。两点夹挤用力。握紧之后不要立即松开，缓慢松开，切记不要快速开合，那样不但起不到锻炼效果，肌肉还会酸痛。\n握力较好，可每周保持锻炼维持身体状态，每组坚持5秒时间左右连续握20下，每天做1\u20142组，组间休息30秒。\n正反握手腕弯举哑铃\n将小臂放在凳子上，手在凳子另一侧下垂。小臂不动，弯屈手腕，只靠手腕的力量来上下举起哑铃。如果没有哑铃也可以用杠铃或者其他合适的器材代替。在整个动作过程中，身体保持同一姿势。除手腕之外，全身其它部位应当保持不动。\n握力较好，可每天坚持锻炼，每组坚持举起20下，每天做1\u20142组，组间休息15秒。\n双臂悬垂\n双手与肩同宽握住横杆，肩胛骨夹紧，将自己悬挂着。坚持尽可能长的时间，双臂悬垂逐步提升后可锻炼自己单臂悬垂的时间长度，这样不仅可以很好的锻炼握力和腕力，同时也能锻炼整个手臂的肌肉。\n握力较好，每组坚持1min，每天做1\u20142组，组间休息60秒。可以在坚持1min在悬垂的时候可以腕部用力尽量将身体向上提一些。\n"},{"title":"肌肉耐力","content":"（一）耐力性（有氧）运动的运动频率，运动频率常用每周的锻炼次数来表示。运动频率取决于运动强度和每次运动持续的时间。一般认为：每周锻炼3~4次，即：隔一天锻炼一次，这种锻炼的效率最高。最低的运动频率为每周锻炼2次。\n　 （二）力量性运动的运动频率力量练习的频率一般为：每日或隔日练习1次。\n（三）伸展运动和健身操的运动频率伸展运动和健身操的运动频率一般为每日1次或每日2次。"},{"title":"注意事项","content":"每次运动之前要求做充分的准备活动；\n应根据动作的难度、幅度等，循序渐进、量力而行；\n运动中注意正确的呼吸方式和节奏；\n训练中如出现不适,应中止活动,并及时与医生取得联系。\n初次参加运动的人，要遵循循序增强，遂步推进的原则，运动的时间要从短到长，运动强度要从弱到强"}]
     */

    private int code;
    private String msg;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * title : 适宜心率
         * content : 您进行体育锻炼 “适宜心率”范围为130.0次/分钟——170.0次/分钟之间，锻炼时至少要保持20 min以上。
         */

        private String title;
        private String content;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
